app/Models/penjualModel.php

    public function hargapenjual($id)
    {
        $data = $this->select('*')
            ->where('tbl_penjual.id_penjual', $id)
            ->find();
---
SELECT *
FROM `tbl_penjual`
WHERE `tbl_penjual`.`id_penjual` = '5'