app/Models/permintaanModel.php

    public function getdatapenjual($id)
    {
        $total_frekuensi = 0;
        $probabilitas_kumulatif = 0;
        $jumlahdata = array();
        $total_hasil_permintaan = 0;
        $rata_rata_hasil_permintaan = 0;
        $data = $this->select('tbl_permintaan.id_permintaan as permintaan')
            ->join('tbl_penjual', 'tbl_permintaan.id_penjual = tbl_penjual.id_penjual')
            ->where('tbl_permintaan.id_penjual', $id)
            ->groupBy('tbl_permintaan.bulan')
            ->findAll();
        foreach ($data as $d) {
            $result['datanya'][$d['permintaan']] = [
                'permintaan' => $d['permintaan'],
                'bulan' => 0,
                'frekuensi' => 0,
                'probabilitas' => 0,
                'probabilitas_kumulatif' => 0,
                'interval_bawah' => 0,
                'interval_atas' => 0,
            ];
        }

        //banyak bulan
        $data = $this->select('tbl_permintaan.id_permintaan as permintaan, tbl_permintaan.bulan as bulan')
            ->join('tbl_penjual', 'tbl_permintaan.id_penjual = tbl_penjual.id_penjual')
            ->where('tbl_permintaan.id_penjual', $id)
            ->groupBy('tbl_permintaan.bulan')
            ->findAll();
---
SELECT `tbl_permintaan`.`id_permintaan` as `permintaan`
FROM `tbl_permintaan`
JOIN `tbl_penjual` ON `tbl_permintaan`.`id_penjual` = `tbl_penjual`.`id_penjual`
WHERE `tbl_permintaan`.`id_penjual` = '5'
GROUP BY `tbl_permintaan`.`bulan`
SELECT `tbl_permintaan`.`id_permintaan` as `permintaan`, `tbl_permintaan`.`bulan` as `bulan`
FROM `tbl_permintaan`
JOIN `tbl_penjual` ON `tbl_permintaan`.`id_penjual` = `tbl_penjual`.`id_penjual`
WHERE `tbl_permintaan`.`id_penjual` = '5'
GROUP BY `tbl_permintaan`.`bulan`

        }

        //banyak frekuensi
        $data = $this->select('tbl_permintaan.id_permintaan as permintaan, tbl_permintaan.frekuensi as frekuensi')
            ->selectSum('tbl_permintaan.frekuensi')
            ->join('tbl_penjual', 'tbl_permintaan.id_penjual = tbl_penjual.id_penjual')
            ->where('tbl_permintaan.id_penjual', $id)
            ->groupBy('tbl_permintaan.bulan')
            ->findAll();
---
SELECT `tbl_permintaan`.`id_permintaan` as `permintaan`, `tbl_permintaan`.`frekuensi` as `frekuensi`, SUM(`tbl_permintaan`.`frekuensi`) AS `frekuensi`
FROM `tbl_permintaan`
JOIN `tbl_penjual` ON `tbl_permintaan`.`id_penjual` = `tbl_penjual`.`id_penjual`
WHERE `tbl_permintaan`.`id_penjual` = '5'
GROUP BY `tbl_permintaan`.`bulan`

            $total_frekuensi += $d['frekuensi'];
        }
        //banyak probabilitas
        $data = $this->select('tbl_permintaan.id_permintaan as permintaan, tbl_permintaan.bulan as bulan, tbl_permintaan.frekuensi as frekuensi')
            ->join('tbl_penjual', 'tbl_permintaan.id_penjual = tbl_penjual.id_penjual')
            ->where('tbl_permintaan.id_penjual', $id)
            ->groupBy('tbl_permintaan.bulan')
            ->findAll();
---
SELECT `tbl_permintaan`.`id_permintaan` as `permintaan`, `tbl_permintaan`.`bulan` as `bulan`, `tbl_permintaan`.`frekuensi` as `frekuensi`
FROM `tbl_permintaan`
JOIN `tbl_penjual` ON `tbl_permintaan`.`id_penjual` = `tbl_penjual`.`id_penjual`
WHERE `tbl_permintaan`.`id_penjual` = '5'
GROUP BY `tbl_permintaan`.`bulan`

        }

        //banyak probabilitas kumulatif
        $data = $this->select('tbl_permintaan.id_permintaan as permintaan, tbl_permintaan.bulan as bulan, tbl_permintaan.frekuensi as frekuensi')
            ->join('tbl_penjual', 'tbl_permintaan.id_penjual = tbl_penjual.id_penjual')
            ->where('tbl_permintaan.id_penjual', $id)
            ->groupBy('tbl_permintaan.bulan')
            ->findAll();
---
SELECT `tbl_permintaan`.`id_permintaan` as `permintaan`, `tbl_permintaan`.`bulan` as `bulan`, `tbl_permintaan`.`frekuensi` as `frekuensi`
FROM `tbl_permintaan`
JOIN `tbl_penjual` ON `tbl_permintaan`.`id_penjual` = `tbl_penjual`.`id_penjual`
WHERE `tbl_permintaan`.`id_penjual` = '5'
GROUP BY `tbl_permintaan`.`bulan`

        }

        //interval bawah
        $data = $this->select('tbl_permintaan.id_permintaan as permintaan, tbl_permintaan.bulan as bulan, tbl_permintaan.frekuensi as frekuensi')
            ->join('tbl_penjual', 'tbl_permintaan.id_penjual = tbl_penjual.id_penjual')
            ->where('tbl_permintaan.id_penjual', $id)
            ->groupBy('tbl_permintaan.bulan')
            ->findAll();
---
SELECT `tbl_permintaan`.`id_permintaan` as `permintaan`, `tbl_permintaan`.`bulan` as `bulan`, `tbl_permintaan`.`frekuensi` as `frekuensi`
FROM `tbl_permintaan`
JOIN `tbl_penjual` ON `tbl_permintaan`.`id_penjual` = `tbl_penjual`.`id_penjual`
WHERE `tbl_permintaan`.`id_penjual` = '5'
GROUP BY `tbl_permintaan`.`bulan`

        }

        //interval atas
        $data = $this->select('tbl_permintaan.id_permintaan as permintaan, tbl_permintaan.bulan as bulan, tbl_permintaan.frekuensi as frekuensi')
            ->join('tbl_penjual', 'tbl_permintaan.id_penjual = tbl_penjual.id_penjual')
            ->where('tbl_permintaan.id_penjual', $id)
            ->groupBy('tbl_permintaan.bulan')
            ->findAll();
---
SELECT `tbl_permintaan`.`id_permintaan` as `permintaan`, `tbl_permintaan`.`bulan` as `bulan`, `tbl_permintaan`.`frekuensi` as `frekuensi`
FROM `tbl_permintaan`
JOIN `tbl_penjual` ON `tbl_permintaan`.`id_penjual` = `tbl_penjual`.`id_penjual`
WHERE `tbl_permintaan`.`id_penjual` = '5'
GROUP BY `tbl_permintaan`.`bulan`

        }

        //membuat array jumlah datanya
        $data = $this->select('tbl_penjual.penaksiran')
            ->join('tbl_penjual', 'tbl_permintaan.id_penjual = tbl_penjual.id_penjual')
            ->where('tbl_permintaan.id_penjual', $id)
            ->groupBy('tbl_penjual.id_penjual')
            ->findAll();
---
SELECT `tbl_penjual`.`penaksiran`
FROM `tbl_permintaan`
JOIN `tbl_penjual` ON `tbl_permintaan`.`id_penjual` = `tbl_penjual`.`id_penjual`
WHERE `tbl_permintaan`.`id_penjual` = '5'
GROUP BY `tbl_penjual`.`id_penjual`

        $result['rata_rata_hasil_permintaan'] = $rata_rata_hasil_permintaan;

        //hitung rata-rata pemasukan
        $data = $this->select('tbl_penjual.harga')
            ->join('tbl_penjual', 'tbl_permintaan.id_penjual = tbl_penjual.id_penjual')
            ->where('tbl_permintaan.id_penjual', $id)
            ->groupBy('tbl_penjual.id_penjual')
            ->findAll();
---
SELECT `tbl_penjual`.`harga`
FROM `tbl_permintaan`
JOIN `tbl_penjual` ON `tbl_permintaan`.`id_penjual` = `tbl_penjual`.`id_penjual`
WHERE `tbl_permintaan`.`id_penjual` = '5'
GROUP BY `tbl_penjual`.`id_penjual`

    public function hitungbulan($id)
    {
        $data = $this->selectcount('bulan')
            ->where('tbl_permintaan.id_penjual', $id)
            ->findAll();
---
SELECT COUNT(`bulan`) AS `bulan`
FROM `tbl_permintaan`
WHERE `tbl_permintaan`.`id_penjual` = '5'