app/Models/permintaanModel.php

SELECT *
FROM `tbl_permintaan`
JOIN `tbl_penjual` ON `tbl_permintaan`.`id_penjual` = `tbl_penjual`.`id_penjual`
WHERE `tbl_permintaan`.`id_penjual` = '5'
---
    public function getdatapenjual($id)
    {
        $data = $this->select('*')
            ->join('tbl_penjual', 'tbl_permintaan.id_penjual = tbl_penjual.id_penjual')
            ->where('tbl_permintaan.id_penjual', $id)
            ->findAll();

SELECT COUNT(`bulan`) AS `bulan`
FROM `tbl_permintaan`
WHERE `tbl_permintaan`.`id_penjual` = '5'
---
    public function hitungbulan($id)
    {
        $data = $this->selectcount('bulan')
            ->where('tbl_permintaan.id_penjual', $id)
            ->findAll();